In [1]:
import pandas as pd
data = {
    "City": ["Delhi", "Delhi", "Mumbai", "Mumbai", "Chennai", "Chennai", "Delhi", "Mumbai"],
    "Product": ["Laptop", "Mobile", "Laptop", "Tablet", "Mobile", "Tablet", "Tablet", "Laptop"],
    "Sales": [70000, 30000, 80000, 20000, 25000, 15000, 22000, 85000],
    "Quantity": [10, 15, 12, 8, 20, 5, 7, 11]
}

In [2]:
data

{'City': ['Delhi',
  'Delhi',
  'Mumbai',
  'Mumbai',
  'Chennai',
  'Chennai',
  'Delhi',
  'Mumbai'],
 'Product': ['Laptop',
  'Mobile',
  'Laptop',
  'Tablet',
  'Mobile',
  'Tablet',
  'Tablet',
  'Laptop'],
 'Sales': [70000, 30000, 80000, 20000, 25000, 15000, 22000, 85000],
 'Quantity': [10, 15, 12, 8, 20, 5, 7, 11]}

In [3]:
df= pd.DataFrame(data)

In [4]:
df

      City Product  Sales  Quantity
0    Delhi  Laptop  70000        10
1    Delhi  Mobile  30000        15
2   Mumbai  Laptop  80000        12
3   Mumbai  Tablet  20000         8
4  Chennai  Mobile  25000        20
5  Chennai  Tablet  15000         5
6    Delhi  Tablet  22000         7
7   Mumbai  Laptop  85000        11

In [5]:
city_summary = df.groupby("City").agg(
    Total_Sales=("Sales", "sum"),
    Avg_Sales=("Sales", "mean"),
    Total_Quantity=("Quantity", "sum")
).reset_index()

print(city_summary)

      City  Total_Sales     Avg_Sales  Total_Quantity
0  Chennai        40000  20000.000000              25
1    Delhi       122000  40666.666667              32
2   Mumbai       185000  61666.666667              31

In [6]:
top_product= df.groupby("City").apply(lambda x: x.nlargest(2,"Sales")).reset_index(drop=True)
top_product

C:\Users\Nitya\AppData\Local\Temp\ipykernel_11388\3021033598.py:1: DeprecationWarning: DataFrameGroupBy.apply operated on the grouping columns. This behavior is deprecated, and in a future version of pandas the grouping columns will be excluded from the operation. Either pass `include_groups=False` to exclude the groupings or explicitly select the grouping columns after groupby to silence this warning.
  top_product= df.groupby("City").apply(lambda x: x.nlargest(2,"Sales")).reset_index(drop=True)

      City Product  Sales  Quantity
0  Chennai  Mobile  25000        20
1  Chennai  Tablet  15000         5
2    Delhi  Laptop  70000        10
3    Delhi  Mobile  30000        15
4   Mumbai  Laptop  85000        11
5   Mumbai  Laptop  80000        12

In [7]:
df_missing = df.copy()
df_missing.loc[2, "Sales"] = None  
df_missing.loc[5, "Product"] = None 
print(df_missing)

      City Product    Sales  Quantity
0    Delhi  Laptop  70000.0        10
1    Delhi  Mobile  30000.0        15
2   Mumbai  Laptop      NaN        12
3   Mumbai  Tablet  20000.0         8
4  Chennai  Mobile  25000.0        20
5  Chennai    None  15000.0         5
6    Delhi  Tablet  22000.0         7
7   Mumbai  Laptop  85000.0        11

In [ ]:
#filling missing data
df_missing["Sales"].fillna(df_missing["Sales"].mean(), inplace=True)
df_missing["Product"].fillna(df_missing["Product"].mode()[0], inplace=True)
df_missing

In [9]:
#merging
city_info = pd.DataFrame({
    "City": ["Delhi", "Mumbai", "Chennai"],
    "Population": [32000000, 21000000, 11500000]
})
merged = pd.merge(city_summary, city_info, on="City", how="left")
print(merged)

      City  Total_Sales     Avg_Sales  Total_Quantity  Population
0  Chennai        40000  20000.000000              25    11500000
1    Delhi       122000  40666.666667              32    32000000
2   Mumbai       185000  61666.666667              31    21000000

In [10]:
#pivot table
pivot_table = df.pivot_table(
    values="Sales", 
    index="City", 
    columns="Product", 
    aggfunc="sum", 
    fill_value=0
)
print(pivot_table)

Product  Laptop  Mobile  Tablet
City
Chennai       0   25000   15000
Delhi     70000   30000   22000
Mumbai   165000       0   20000